//******************************
// 定数
//

// 攻撃系パラメータ
const POWER = 0;
const STAMINA = 1;
const TOP_SPEED = 2;
const ACCELERATION = 3;
const RESPONSE = 4;
const JUMP = 5;
const AGILITY = 6;
const DRIBBLE_ACCURACY = 7;
const DRIBBLE_SPEED = 8;
const SHORTPASS_ACCURACY = 9;
const SHORTPASS_SPEED = 10;
const LONGPASS_ACCURACY = 11;
const LONGPASS_SPEED = 12;
const SHOOT_ACCURACY = 13;
const SHOOT_MAKING = 14;
const SHOOT_TECH = 15;
const FREEKICK_ACCURACY = 16;
const CURVE = 17;
const BALL_TECH = 18;
const OFFENSIVE = 19;

// 守備系パラメータ
const PASS_CUT = 20;
const TACKLE = 21;
const MAN_MARKING = 22;
const COVERING = 23;
const CHASING = 24;
const SAVING = 25;
const HIGHBALL = 26;

// 攻撃・守備系パラメータ
const HEADING = 27;
const POSITIONING = 28;

// メンタルパラメータ
const MENTALITY = 29;
const COMBINATION = 30;
const CONDITION_STABILITY = 31;
const STRATEGIC_EYE = 32;
const CREATIVITY = 33;
const FAIR_PLAY = 34;

// 戦術
const TACTICS_POSSESSION = 0;
const TACTICS_PRESS = 1;
const TACTICS_COUNTER = 2;
const TACTICS_CATENACCIO = 3;
const TACTICS_FREE = 4;

//******************************
// システムデータ
//
var system_data = [
		{
			name : "4-1-3-2",
			positions : [ "GK", "右SB", "右CB", "左CB", "左SB", "DMF", "右SMF",
					"左SMF", "OMF", "右CF", "左CF" ],
            x : [ 50, 87.5, 62.5, 37.5, 12.5, 50, 87.5, 12.5, 50, 70, 30 ],
            y : [ 91, 68, 68, 68, 68, 55, 42, 42, 32, 16, 16 ]
		},
		{
			name : "4-2-2-2",
			positions : [ "GK", "右SB", "右CB", "左CB", "左SB", "右DMF", "左DMF",
					"右OMF", "左OMF", "右CF", "左CF" ],
            x : [ 50, 87.5, 62.5, 37.5, 12.5, 70, 30, 70, 30, 70, 30 ],
            y : [ 91, 68, 68, 68, 68, 52, 52, 32, 32, 16, 16 ]
		},
		{
			name : "4-4-2",
			positions : [ "GK", "右SB", "右CB", "左CB", "左SB", "右DMF", "左DMF",
					"右SMF", "左SMF", "右CF", "左CF" ],
            x : [ 50, 87.5, 62.5, 37.5, 12.5, 70, 30, 87.5, 12.5, 70, 30 ],
            y : [ 91, 68, 68, 68, 68, 52, 52, 32, 32, 16, 16 ]
		},
		{
			name : "4-3-1-2",
			positions : [ "GK", "右SB", "右CB", "左CB", "左SB", "DMF", "右CMF",
					"左CMF", "OMF", "右CF", "左CF" ],
            x : [ 50, 87.5, 62.5, 37.5, 12.5, 50, 80, 20, 50, 70, 30 ],
            y : [ 91, 68, 68, 68, 68, 54, 46, 46, 32, 16, 16 ]
		},
		{
			name : "4-1-4-1",
			positions : [ "GK", "右SB", "右CB", "左CB", "左SB", "DMF", "右SMF",
					"左SMF", "右OMF", "左OMF", "CF" ],
            x : [ 50, 87.5, 62.5, 37.5, 12.5, 50, 87.5, 12.5, 70, 30, 50 ],
            y : [ 91, 68, 68, 68, 68, 55, 32, 32, 32, 32, 16 ]
		},
		{
			name : "4-2-3-1",
			positions : [ "GK", "右SB", "右CB", "左CB", "左SB", "右DMF", "左DMF",
					"右SMF", "左SMF", "OMF", "CF" ],
            x : [ 50, 87.5, 62.5, 37.5, 12.5, 70, 30, 87.5, 12.5, 50, 50 ],
            y : [ 91, 68, 68, 68, 68, 55, 55, 32, 32, 32, 16 ]
		},
		{
			name : "4-3-2-1A",
			positions : [ "GK", "右SB", "右CB", "左CB", "左SB", "DMF", "右CMF",
					"左CMF", "右SMF", "左SMF", "CF" ],
            x : [ 50, 87.5, 62.5, 37.5, 12.5, 50, 80, 20, 87.5, 12.5, 50 ],
            y : [ 91, 68, 68, 68, 68, 55, 43, 43, 32, 32, 16 ]
		},
		{
			name : "4-3-2-1B",
			positions : [ "GK", "右SB", "右CB", "左CB", "左SB", "DMF", "右CMF",
					"左CMF", "右OMF", "左OMF", "CF" ],
            x : [ 50, 87.5, 62.5, 37.5, 12.5, 50, 80, 20, 70, 30, 50 ],
            y : [ 91, 68, 68, 68, 68, 55, 43, 43, 32, 32, 16 ]
		},
		{
			name : "4-1-2-3",
			positions : [ "GK", "右SB", "右CB", "左CB", "左SB", "DMF", "右OMF",
					"左OMF", "右WG", "左WG", "CF" ],
            x : [ 50, 87.5, 62.5, 37.5, 12.5, 50, 70, 30, 87.5, 12.5, 50 ],
            y : [ 91, 68, 68, 68, 68, 52, 32, 32, 20, 20, 16 ]
		},
		{
			name : "4-2-1-3",
			positions : [ "GK", "右SB", "右CB", "左CB", "左SB", "右DMF", "左DMF",
					"OMF", "右WG", "左WG", "CF" ],
            x : [ 50, 87.5, 62.5, 37.5, 12.5, 70, 30, 50, 87.5, 12.5, 50 ],
            y : [ 91, 68, 68, 68, 68, 52, 52, 32, 20, 20, 16 ]
		},
		{
			name : "3-1-3-3",
			positions : [ "GK", "SW", "右CB", "左CB", "DMF", "右SMF", "左SMF",
					"OMF", "右WG", "左WG", "CF" ],
            x : [ 50, 50, 80, 20, 50, 87.5, 12.5, 50, 87.5, 12.5, 50 ],
            y : [ 91, 75, 68, 68, 52, 40, 40, 32, 20, 20, 16 ]
		},
		{
			name : "3-2-2-3",
			positions : [ "GK", "SW", "右CB", "左CB", "右DMF", "左DMF", "右OMF",
					"左OMF", "右WG", "左WG", "CF" ],
            x : [ 50, 50, 80, 20, 70, 30, 70, 30, 87.5, 12.5, 50 ],
            y : [ 91, 75, 68, 68, 52, 52, 32, 32, 20, 20, 16 ]
		},
		{
			name : "3-4-3",
			positions : [ "GK", "SW", "右CB", "左CB", "右DMF", "左DMF", "右SMF",
					"左SMF", "右WG", "左WG", "CF" ],
            x : [ 50, 50, 80, 20, 70, 30, 87.5, 12.5, 87.5, 12.5, 50 ],
            y : [ 91, 75, 68, 68, 52, 52, 35, 35, 16, 16, 16 ]
		},
		{
			name : "3-3-2-2",
			positions : [ "GK", "SW", "右CB", "左CB", "DMF", "右SMF", "左SMF",
					"右OMF", "左OMF", "右CF", "左CF" ],
            x : [ 50, 50, 80, 20, 50, 87.5, 12.5, 70, 30, 70, 30 ],
            y : [ 91, 75, 68, 68, 52, 43, 43, 32, 32, 16, 16 ]
		},
		{
			name : "3-2-3-2",
			positions : [ "GK", "SW", "右CB", "左CB", "右DMF", "左DMF", "右SMF",
					"左SMF", "OMF", "右CF", "左CF" ],
            x : [ 50, 50, 80, 20, 70, 30, 87.5, 12.5, 50, 70, 30 ],
            y : [ 91, 75, 68, 68, 52, 52, 40, 40, 32, 16, 16 ]
		},
		{
			name : "3-3-3-1",
			positions : [ "GK", "SW", "右CB", "左CB", "DMF", "右SMF", "CMF",
					"左SMF", "右OMF", "左OMF", "CF" ],
            x : [ 50, 50, 80, 20, 50, 87.5, 50, 12.5, 70, 30, 50 ],
            y : [ 91, 75, 68, 68, 55, 48, 40, 48, 32, 32, 16 ]
		},
		{
			name : "3-4-2-1",
			positions : [ "GK", "SW", "右CB", "左CB", "右DMF", "左DMF", "右SMF",
					"左SMF", "右OMF", "左OMF", "CF" ],
            x : [ 50, 50, 80, 20, 70, 30, 87.5, 12.5, 70, 30, 50 ],
            y : [ 91, 75, 68, 68, 55, 55, 45, 45, 32, 32, 16 ]
		},
		{
			name : "5-1-2-2",
			positions : [ "GK", "SW", "右SB", "右CB", "左CB", "左SB", "DMF",
					"右OMF", "左OMF", "右CF", "左CF" ],
            x : [ 50, 50, 87.5, 62.5, 37.5, 12.5, 50, 70, 30, 70, 30 ],
            y : [ 91, 78, 68, 68, 68, 68, 52, 32, 32, 16, 16 ]
		},
		{
			name : "5-2-1-2",
			positions : [ "GK", "SW", "右SB", "右CB", "左CB", "左SB", "右DMF",
					"左DMF", "OMF", "右CF", "左CF" ],
            x : [ 50, 50, 87.5, 62.5, 37.5, 12.5, 70, 30, 50, 70, 30 ],
            y : [ 91, 78, 68, 68, 68, 68, 52, 52, 32, 16, 16 ]
		},
		{
			name : "5-1-3-1",
			positions : [ "GK", "SW", "右SB", "右CB", "左CB", "左SB", "DMF",
					"右SMF", "左SMF", "OMF", "CF" ],
            x : [ 50, 50, 87.5, 62.5, 37.5, 12.5, 50, 87.5, 12.5, 50, 50 ],
            y : [ 91, 78, 68, 68, 68, 68, 55, 40, 40, 32, 16 ]
		},
		{
			name : "5-2-2-1",
			positions : [ "GK", "SW", "右SB", "右CB", "左CB", "左SB", "右DMF",
					"左DMF", "右OMF", "左OMF", "CF" ],
            x : [ 50, 50, 87.5, 62.5, 37.5, 12.5, 70, 30, 70, 30, 50 ],
            y : [ 91, 78, 68, 68, 68, 68, 52, 52, 32, 32, 16 ]
		},
		{
			name : "5-4-1",
			positions : [ "GK", "SW", "右SB", "右CB", "左CB", "左SB", "右DMF",
					"左DMF", "右SMF", "左SMF", "CF" ],
            x : [ 50, 50, 87.5, 62.5, 37.5, 12.5, 70, 30, 87.5, 12.5, 50 ],
            y : [ 91, 78, 68, 68, 68, 68, 52, 52, 40, 40, 16 ]
		} ];

// ******************************
// 戦略データ
//
var tactics_data = [
{
	name : "ポゼッション重視",
	description : "ショートパスを多用し、ボールを動かすことによってボール支配率を高めます。",
    description2 : "主な効果：自チームが攻撃側に回る頻度が少アップ。"
},
{
	name : "プレスディフェンス",
	description : "前線から激しいプレスによりボールを奪い、ショートカウンターを狙います。",
    description2 : "主な効果：カウンター発動率及びFW/MF選手の守備能力が少アップ。"
},
{
	name : "カウンターアタック",
	description : "引いて守り速攻からゴールを狙います。",
    description2 : "主な効果：カウンター発動率及びMF/DF選手の守備能力が少アップ。"
},
{
	name : "カテナチオ",
	description : "全員でゴールを固め守備に徹します。",
    description2 : "主な効果：全選手の守備パラメータ小アップ、攻撃パラメータ小ダウン。自チームが攻撃側に回る頻度が少ダウン。"
},
{
	name : "自由に戦え",
	description : "具体的な指示を与えず自由に選手に戦わせます。",
    description2 : "主な効果：特になし。"
}
];

// ******************************
// エリアデータ
//
var area_data = {
	"FW_M" : {
		name : "前線中央",
		offences : [ [ "CF", 40 ], [ "左CF", 40 ], [ "右CF", 40 ], [ "OMF", 30 ],
				[ "左OMF", 30 ], [ "右OMF", 30 ], [ "左WG", 20 ], [ "右WG", 20 ],
				[ "左SMF", 15 ], [ "右SMF", 15 ], [ "CMF", 15 ], [ "左CMF", 15 ],
				[ "右CMF", 15 ], [ "DMF", 10 ], [ "左DMF", 10 ], [ "右DMF", 10 ] ],
		matchup : {
			"CF" : [ [ "SW" ], [ "左CB", "右CB" ], [ "DMF" ], [ "左DMF", "右DMF" ],
					[ "CMF" ] ],
			"左CF" : [ [ "右CB" ], [ "右DMF" ], [ "SW" ], [ "DMF" ], [ "右CMF" ] ],
			"右CF" : [ [ "左CB" ], [ "左DMF" ], [ "SW" ], [ "DMF" ], [ "左CMF" ] ],
			"OMF" : [ [ "DMF" ], [ "左DMF", "右DMF" ], [ "左CB", "右CB" ],
					[ "SW" ], [ "CMF" ] ],
			"左OMF" : [ [ "右DMF" ], [ "DMF" ], [ "右CB" ], [ "左DMF" ], [ "左CB" ] ],
			"右OMF" : [ [ "左DMF" ], [ "DMF" ], [ "左CB" ], [ "右DMF" ], [ "右CB" ] ],
			"左WG" : [ [ "右CB" ], [ "SW" ], [ "右DMF" ], [ "右SB" ], [ "DMF" ] ],
			"右WG" : [ [ "左CB" ], [ "SW" ], [ "左DMF" ], [ "左SB" ], [ "DMF" ] ],
			"左SMF" : [ [ "右CMF" ], [ "右DMF" ], [ "SW" ], [ "右CB" ], [ "DMF" ] ],
			"右SMF" : [ [ "左CMF" ], [ "左DMF" ], [ "SW" ], [ "左CB" ], [ "DMF" ] ],
			"CMF" : [ [ "CMF" ], [ "DMF" ], [ "左DMF", "右DMF" ],
					[ "左CB", "右CB" ], [ "SW" ] ],
			"左CMF" : [ [ "右CMF" ], [ "右DMF" ], [ "右CB" ], [ "SW" ], [ "DMF" ] ],
			"右CMF" : [ [ "左CMF" ], [ "左DMF" ], [ "左CB" ], [ "SW" ], [ "DMF" ] ],
			"DMF" : [ [ "DMF" ], [ "CMF" ], [ "左DMF", "右DMF" ], [ "SW" ],
					[ "OMF" ] ],
			"左DMF" : [ [ "右DMF" ], [ "右CMF" ], [ "右CB" ], [ "DMF" ], [ "SW" ] ],
			"右DMF" : [ [ "左DMF" ], [ "左CMF" ], [ "左CB" ], [ "DMF" ], [ "SW" ] ]
		},
		actions : [ "ショートパス", "ドリブル突破", "飛び出し", "ポストプレー" ]
	},
	"FW_L" : {
		name : "前線左サイド",
		offences : [ [ "左WG", 40 ], [ "左SMF", 30 ], [ "左CF", 30 ],
				[ "CF", 15 ], [ "左SB", 15 ], [ "左OMF", 15 ], [ "左CMF", 15 ],
				[ "OMF", 10 ], [ "CMF", 10 ] ],
		matchup : {
			"左WG" : [ [ "右SB" ], [ "右SMF" ], [ "右CB" ], [ "右DMF" ], [ "DMF" ] ],
			"左SMF" : [ [ "右SMF" ], [ "右SB" ], [ "右CB" ], [ "右DMF" ], [ "右CMF" ] ],
			"左CF" : [ [ "右CB" ], [ "右SB" ], [ "右SMF" ], [ "右DMF" ], [ "DMF" ] ],
			"CF" : [ [ "右CB" ], [ "右SB" ], [ "SW" ], [ "右SMF" ], [ "右DMF" ] ],
			"左SB" : [ [ "右SB" ], [ "右SMF" ], [ "右CB" ], [ "右DMF" ], [ "右CMF" ] ],
			"左OMF" : [ [ "右DMF" ], [ "右CMF" ], [ "右CB" ], [ "右SB" ], [ "右SMF" ] ],
			"左CMF" : [ [ "右CMF" ], [ "右CB" ], [ "右SB" ], [ "右DMF" ], [ "右SMF" ] ],
			"OMF" : [ [ "右DMF" ], [ "右CMF" ], [ "右CB" ], [ "右SB" ], [ "DMF" ] ],
			"CMF" : [ [ "右DMF" ], [ "右CMF" ], [ "右SB" ], [ "右CB" ], [ "DMF" ] ]
		},
		actions : [ "ショートパス", "ドリブル突破", "飛び出し" ]
	},
	"FW_R" : {
		name : "前線右サイド",
		offences : [ [ "右WG", 40 ], [ "右SMF", 30 ], [ "右CF", 30 ],
				[ "CF", 15 ], [ "右SB", 15 ], [ "右OMF", 15 ], [ "右CMF", 15 ],
				[ "OMF", 10 ], [ "CMF", 10 ] ],
		matchup : {
			"右WG" : [ [ "左SB" ], [ "左SMF" ], [ "左CB" ], [ "左DMF" ], [ "DMF" ] ],
			"右SMF" : [ [ "左SMF" ], [ "左SB" ], [ "左CB" ], [ "左DMF" ], [ "左CMF" ] ],
			"右CF" : [ [ "左CB" ], [ "左SB" ], [ "左SMF" ], [ "左DMF" ], [ "DMF" ] ],
			"CF" : [ [ "左CB" ], [ "左SB" ], [ "SW" ], [ "左SMF" ], [ "左DMF" ] ],
			"右SB" : [ [ "左SB" ], [ "左SMF" ], [ "左CB" ], [ "左DMF" ], [ "左CMF" ] ],
			"右OMF" : [ [ "左DMF" ], [ "左CMF" ], [ "左CB" ], [ "左SB" ], [ "左SMF" ] ],
			"右CMF" : [ [ "左CMF" ], [ "左CB" ], [ "左SB" ], [ "左DMF" ], [ "左SMF" ] ],
			"OMF" : [ [ "左DMF" ], [ "左CMF" ], [ "左CB" ], [ "左SB" ], [ "DMF" ] ],
			"CMF" : [ [ "左DMF" ], [ "左CMF" ], [ "左SB" ], [ "左CB" ], [ "DMF" ] ]
		},
		actions : [ "ショートパス", "ドリブル突破", "飛び出し" ]
	},
	"MF_M" : {
		name : "中盤中央",
		offences : [ [ "CMF", 40 ], [ "左CMF", 40 ], [ "右CMF", 40 ],
				[ "OMF", 40 ], [ "左OMF", 40 ], [ "右OMF", 40 ], [ "DMF", 30 ],
				[ "左DMF", 30 ], [ "右DMF", 30 ], [ "CF", 15 ], [ "左CF", 15 ],
				[ "右CF", 15 ], [ "左SMF", 10 ], [ "右SMF", 10 ] ],
		matchup : {
			"CMF" : [ [ "CMF" ], [ "左CMF", "右CMF" ], [ "DMF" ],
					[ "左DMF", "右DMF" ], [ "CF" ] ],
			"左CMF" : [ [ "右CMF" ], [ "CMF" ], [ "右DMF" ], [ "DMF" ], [ "右CF" ] ],
			"右CMF" : [ [ "左CMF" ], [ "CMF" ], [ "左DMF" ], [ "DMF" ], [ "左CF" ] ],
			"OMF" : [ [ "DMF" ], [ "左DMF", "右DMF" ], [ "CMF" ],
					[ "左CMF", "右CMF" ], [ "OMF" ] ],
			"左OMF" : [ [ "右DMF" ], [ "DMF" ], [ "右CMF" ], [ "CMF" ], [ "右OMF" ] ],
			"右OMF" : [ [ "左DMF" ], [ "DMF" ], [ "左CMF" ], [ "CMF" ], [ "左OMF" ] ],
			"DMF" : [ [ "OMF" ], [ "左OMF", "右OMF" ], [ "CMF" ], [ "DMF" ],
					[ "左DMF", "右DMF" ] ],
			"左DMF" : [ [ "右OMF" ], [ "OMF" ], [ "右CMF" ], [ "右CF" ], [ "右DMF" ] ],
			"右DMF" : [ [ "左OMF" ], [ "OMF" ], [ "左CMF" ], [ "左CF" ], [ "左DMF" ] ],
			"CF" : [ [ "DMF" ], [ "左DMF", "右DMF" ], [ "CMF" ],
					[ "左CMF", "右CMF" ], [ "OMF" ] ],
			"左CF" : [ [ "右DMF" ], [ "DMF" ], [ "右CMF" ], [ "CMF" ], [ "右OMF" ] ],
			"右CF" : [ [ "左DMF" ], [ "DMF" ], [ "左CMF" ], [ "CMF" ], [ "左OMF" ] ],
			"左SMF" : [ [ "右SMF" ], [ "右CMF" ], [ "右DMF" ], [ "CMF" ], [ "DMF" ] ],
			"右SMF" : [ [ "左SMF" ], [ "左CMF" ], [ "左DMF" ], [ "CMF" ], [ "DMF" ] ]
		},
		actions : [ "ロングパス", "ショートパス", "ドリブル突破", "ポストプレー" ]
	},
	"MF_L" : {
		name : "中盤左サイド",
		offences : [ [ "左SMF", 40 ], [ "左CMF", 30 ], [ "左OMF", 30 ],
				[ "左SB", 30 ], [ "左WG", 30 ], [ "左DMF", 20 ], [ "OMF", 15 ],
				[ "CMF", 15 ], [ "DMF", 15 ] ],
		matchup : {
			"左SMF" : [ [ "右SMF" ], [ "右CMF" ], [ "右DMF" ], [ "右OMF" ],
					[ "DMF" ] ],
			"左CMF" : [ [ "右CMF" ], [ "右SMF" ], [ "右DMF" ], [ "右OMF" ],
					[ "DMF" ] ],
			"左OMF" : [ [ "右DMF" ], [ "右SMF" ], [ "右CMF" ], [ "DMF" ], [ "CMF" ] ],
			"左SB" : [ [ "右SMF" ], [ "右OMF" ], [ "右CMF" ], [ "右DMF" ], [ "DMF" ] ],
			"左WG" : [ [ "右SMF" ], [ "右DMF" ], [ "右CMF" ], [ "右OMF" ], [ "DMF" ] ],
			"左DMF" : [ [ "右OMF" ], [ "右SMF" ], [ "右CMF" ], [ "右DMF" ],
					[ "DMF" ] ],
			"OMF" : [ [ "右DMF" ], [ "DMF" ], [ "右SMF" ], [ "右CMF" ], [ "右OMF" ] ],
			"CMF" : [ [ "右CMF" ], [ "CMF" ], [ "右SMF" ], [ "右OMF" ], [ "DMF" ] ],
			"DMF" : [ [ "右OMF" ], [ "OMF" ], [ "右SMF" ], [ "右CMF" ], [ "右DMF" ] ]
		},
		actions : [ "ロングパス", "ショートパス", "ドリブル突破" ]
	},
	"MF_R" : {
		name : "中盤右サイド",
		offences : [ [ "右SMF", 40 ], [ "右CMF", 30 ], [ "右OMF", 30 ],
				[ "右SB", 30 ], [ "右WG", 30 ], [ "右DMF", 20 ], [ "OMF", 15 ],
				[ "CMF", 15 ], [ "DMF", 15 ] ],
		matchup : {
			"右SMF" : [ [ "左SMF" ], [ "左CMF" ], [ "左DMF" ], [ "左OMF" ],
					[ "DMF" ] ],
			"右CMF" : [ [ "左CMF" ], [ "左SMF" ], [ "左DMF" ], [ "左OMF" ],
					[ "DMF" ] ],
			"右OMF" : [ [ "左DMF" ], [ "左SMF" ], [ "左CMF" ], [ "DMF" ], [ "CMF" ] ],
			"右SB" : [ [ "左SMF" ], [ "左OMF" ], [ "左CMF" ], [ "左DMF" ], [ "DMF" ] ],
			"右WG" : [ [ "左SMF" ], [ "左DMF" ], [ "左CMF" ], [ "左OMF" ], [ "DMF" ] ],
			"右DMF" : [ [ "左OMF" ], [ "左SMF" ], [ "左CMF" ], [ "左DMF" ],
					[ "DMF" ] ],
			"OMF" : [ [ "左DMF" ], [ "DMF" ], [ "左SMF" ], [ "左CMF" ], [ "左OMF" ] ],
			"CMF" : [ [ "左CMF" ], [ "CMF" ], [ "左SMF" ], [ "左OMF" ], [ "DMF" ] ],
			"DMF" : [ [ "左OMF" ], [ "OMF" ], [ "左SMF" ], [ "左CMF" ], [ "左DMF" ] ]
		},
		actions : [ "ロングパス", "ショートパス", "ドリブル突破" ]
	},
	"DF_M" : {
		name : "DFライン中央",
		offences : [ [ "SW", 40 ], [ "左CB", 40 ], [ "右CB", 40 ], [ "DMF", 25 ],
				[ "左DMF", 25 ], [ "右DMF", 25 ] ],
		matchup : {
			"SW" : [ [ "CF" ], [ "左CF", "右CF" ], [ "OMF" ], [ "左OMF", "右OMF" ],
					[] ],
			"左CB" : [ [ "右CF" ], [ "CF" ], [ "右OMF" ], [ "左CF" ], [ "左OMF" ] ],
			"右CB" : [ [ "左CF" ], [ "CF" ], [ "左OMF" ], [ "右CF" ], [ "右OMF" ] ],
			"DMF" : [ [ "OMF" ], [ "CF" ], [ "左OMF", "右OMF" ],
					[ "左CF", "右CF" ], [] ],
			"左DMF" : [ [ "右OMF" ], [ "右CF" ], [ "左OMF" ], [ "CF" ], [ "左CF" ] ],
			"右DMF" : [ [ "左OMF" ], [ "左CF" ], [ "右OMF" ], [ "CF" ], [ "右CF" ] ]
		},
		actions : [ "ロングパス", "ショートパス" ]
	},
	"DF_L" : {
		name : "DFライン左サイド",
		offences : [ [ "左SB", 40 ], [ "左CB", 30 ], [ "左DMF", 30 ],
				[ "左CMF", 30 ], [ "SW", 20 ], [ "DMF", 20 ] ],
		matchup : {
			"左SB" : [ [ "右WG" ], [ "右CF" ], [ "右SMF" ], [ "右OMF" ], [ "OMF" ] ],
			"左CB" : [ [ "右CF" ], [ "右WG" ], [ "右OMF" ], [ "CF" ], [ "右SMF" ] ],
			"左DMF" : [ [ "右OMF" ], [ "右CF" ], [ "右WG" ], [ "右SMF" ], [ "OMF" ] ],
			"左CMF" : [ [ "右OMF" ], [ "右CF" ], [ "右WG" ], [ "右SMF" ], [ "OMF" ] ],
			"SW" : [ [ "右CF" ], [ "右WG" ], [ "右OMF" ], [ "CF" ], [ "OMF" ] ],
			"DMF" : [ [ "右OMF" ], [ "右CF" ], [ "右WG" ], [ "右SMF" ], [ "OMF" ] ]
		},
		actions : [ "ロングパス", "ショートパス" ]
	},
	"DF_R" : {
		name : "DFライン右サイド",
		offences : [ [ "右SB", 40 ], [ "右CB", 30 ], [ "右DMF", 30 ],
				[ "右CMF", 30 ], [ "SW", 20 ], [ "DMF", 20 ] ],
		matchup : {
			"右SB" : [ [ "左WG" ], [ "左CF" ], [ "左SMF" ], [ "左OMF" ], [ "OMF" ] ],
			"右CB" : [ [ "左CF" ], [ "左WG" ], [ "左OMF" ], [ "CF" ], [ "左SMF" ] ],
			"右DMF" : [ [ "左OMF" ], [ "左CF" ], [ "左WG" ], [ "左SMF" ], [ "OMF" ] ],
			"右CMF" : [ [ "左OMF" ], [ "左CF" ], [ "左WG" ], [ "左SMF" ], [ "OMF" ] ],
			"SW" : [ [ "左CF" ], [ "左WG" ], [ "左OMF" ], [ "CF" ], [ "OMF" ] ],
			"DMF" : [ [ "左OMF" ], [ "左CF" ], [ "左WG" ], [ "左SMF" ], [ "OMF" ] ]
		},
		actions : [ "ロングパス", "ショートパス" ]
	},
	"CR_L" : {
		name : "クロス左サイド",
		offences : [ [ "CF", 40 ], [ "左CF", 40 ], [ "右CF", 40 ], [ "左WG", 30 ],
				[ "右WG", 30 ], [ "OMF", 30 ], [ "左OMF", 30 ], [ "右OMF", 30 ],
				[ "左SMF", 20 ], [ "右SMF", 20 ], [ "CMF", 20 ], [ "左CMF", 20 ],
				[ "右CMF", 20 ], [ "左SB", 5 ], [ "右SB", 5 ] ],
		matchup : {
			"CF" : [ [ "SW" ], [ "左CB", "右CB" ], [ "DMF" ], [ "左DMF", "右DMF" ],
					[ "CMF" ] ],
			"左CF" : [ [ "右CB" ], [ "SW" ], [ "左CB" ], [ "右DMF" ], [ "左DMF" ] ],
			"右CF" : [ [ "左CB" ], [ "SW" ], [ "右CB" ], [ "左DMF" ], [ "右DMF" ] ],
			"左WG" : [ [ "右SB" ], [ "右CB" ], [ "SW" ], [ "右DMF" ], [ "DMF" ] ],
			"右WG" : [ [ "左SB" ], [ "左CB" ], [ "SW" ], [ "左DMF" ], [ "DMF" ] ],
			"OMF" : [ [ "DMF" ], [ "左DMF", "右DMF" ], [ "SW" ],
					[ "左CB", "右CB" ], [ "CMF" ] ],
			"左OMF" : [ [ "右DMF" ], [ "DMF" ], [ "右CB" ], [ "SW" ], [ "右CMF" ] ],
			"右OMF" : [ [ "左DMF" ], [ "DMF" ], [ "左CB" ], [ "SW" ], [ "左CMF" ] ],
			"左SMF" : [ [ "右SB" ], [ "右CB" ], [ "右DMF" ], [ "右CMF" ], [ "右SMF" ] ],
			"右SMF" : [ [ "左SB" ], [ "左CB" ], [ "左DMF" ], [ "左CMF" ], [ "左SMF" ] ],
			"CMF" : [ [ "CMF" ], [ "左CMF", "右CMF" ], [ "DMF" ],
					[ "左DMF", "右DMF" ], [ "SW" ] ],
			"左CMF" : [ [ "右CMF" ], [ "CMF" ], [ "右DMF" ], [ "DMF" ], [ "左CB" ] ],
			"右CMF" : [ [ "左CMF" ], [ "CMF" ], [ "左DMF" ], [ "DMF" ], [ "右CB" ] ],
			"左SB" : [ [ "右SB" ], [ "右CB" ], [ "右DMF" ], [ "右CMF" ], [ "右SMF" ] ],
			"右SB" : [ [ "左SB" ], [ "左CB" ], [ "左DMF" ], [ "左CMF" ], [ "左SMF" ] ]
		},
		actions : [ "ボレーシュート", "ヘディングシュート" ]
	},
	"CR_R" : {
		name : "クロス右サイド",
		offences : [ [ "CF", 40 ], [ "左CF", 40 ], [ "右CF", 40 ], [ "左WG", 30 ],
				[ "右WG", 30 ], [ "OMF", 30 ], [ "左OMF", 30 ], [ "右OMF", 30 ],
				[ "左SMF", 20 ], [ "右SMF", 20 ], [ "CMF", 20 ], [ "左CMF", 20 ],
				[ "右CMF", 20 ], [ "左SB", 5 ], [ "右SB", 5 ] ],
		matchup : {
			"CF" : [ [ "SW" ], [ "左CB", "右CB" ], [ "DMF" ], [ "左DMF", "右DMF" ],
					[ "CMF" ] ],
			"左CF" : [ [ "右CB" ], [ "SW" ], [ "左CB" ], [ "右DMF" ], [ "左DMF" ] ],
			"右CF" : [ [ "左CB" ], [ "SW" ], [ "右CB" ], [ "左DMF" ], [ "右DMF" ] ],
			"左WG" : [ [ "右SB" ], [ "右CB" ], [ "SW" ], [ "右DMF" ], [ "DMF" ] ],
			"右WG" : [ [ "左SB" ], [ "左CB" ], [ "SW" ], [ "左DMF" ], [ "DMF" ] ],
			"OMF" : [ [ "DMF" ], [ "左DMF", "右DMF" ], [ "SW" ],
					[ "左CB", "右CB" ], [ "CMF" ] ],
			"左OMF" : [ [ "右DMF" ], [ "DMF" ], [ "右CB" ], [ "SW" ], [ "右CMF" ] ],
			"右OMF" : [ [ "左DMF" ], [ "DMF" ], [ "左CB" ], [ "SW" ], [ "左CMF" ] ],
			"左SMF" : [ [ "右SB" ], [ "右CB" ], [ "右DMF" ], [ "右CMF" ], [ "右SMF" ] ],
			"右SMF" : [ [ "左SB" ], [ "左CB" ], [ "左DMF" ], [ "左CMF" ], [ "左SMF" ] ],
			"CMF" : [ [ "CMF" ], [ "左CMF", "右CMF" ], [ "DMF" ],
					[ "左DMF", "右DMF" ], [ "SW" ] ],
			"左CMF" : [ [ "右CMF" ], [ "CMF" ], [ "右DMF" ], [ "DMF" ], [ "左CB" ] ],
			"右CMF" : [ [ "左CMF" ], [ "CMF" ], [ "左DMF" ], [ "DMF" ], [ "右CB" ] ],
			"左SB" : [ [ "右SB" ], [ "右CB" ], [ "右DMF" ], [ "右CMF" ], [ "右SMF" ] ],
			"右SB" : [ [ "左SB" ], [ "左CB" ], [ "左DMF" ], [ "左CMF" ], [ "左SMF" ] ]
		},
		actions : [ "ボレーシュート", "ヘディングシュート" ]
	}
};

// ******************************
// シナリオデータ
//
var scenario_data = {
	"ショートパス|成功|ショートパス|同" : "【攻撃選手】が味方とのワンツーで【守備選手】をかわし【対象エリア】を突破！",
	"ショートパス|成功|ロングパス|同" : "【対象エリア】でボールをキープした【攻撃選手】が味方とのワンツー！　【守備選手】はこれを止められない！",
	"ショートパス|成功|ドリブル突破|同" : "【対象エリア】でボールを受けた【攻撃選手】がワンツーでマークしていた【守備選手】をかわす！",
	"ショートパス|成功|飛び出し|同" : "【対象エリア】の【攻撃選手】が【守備選手】をかわし味方へショートパス、そのままウラへ走りリターンパスをもらう！",
	"ショートパス|成功|ポストプレー|同" : "【攻撃選手】がワンツーで【対象エリア】を突破！　【守備選手】はこれを防げない！",
	"ショートパス|成功|ショートパス|別" : "【対象エリア】の【攻撃選手】が【守備選手】をかわして【次の攻撃選手】へボールをつなぐ！",
	"ショートパス|成功|ロングパス|別" : "【対象エリア】でボールをキープした【攻撃選手】から【次の攻撃選手】へショートパス、【守備選手】はこれを防げない！",
	"ショートパス|成功|ドリブル突破|別" : "【対象エリア】の【攻撃選手】が【次の攻撃選手】へショートパス、【守備選手】はパスカットできない！",
	"ショートパス|成功|飛び出し|別" : "【対象エリア】、【攻撃選手】が【守備選手】をかわして前線へスルーパスを通す！",
	"ショートパス|成功|ポストプレー|別" : "【対象エリア】の【攻撃選手】がマークしていた【守備選手】を振り切り縦パスを送る！",
	"ショートパス|成功|クロス" : "【攻撃選手】が味方とのパス交換で、マークしていた【守備選手】を振り切り【対象エリア】を突破！",
	"ショートパス|成功|シュート" : "【攻撃選手】が味方とのパス交換で、マークしていた【守備選手】を振り切り【対象エリア】を突破！",
	"ロングパス|成功|ショートパス|別" : "【対象エリア】でボールを受けた【攻撃選手】が【守備選手】をかわしてロングパスを送る！",
	"ロングパス|成功|ドリブル突破|別" : "【対象エリア】の【攻撃選手】がロングパス！　【守備選手】はこれを止められない。",
	"ロングパス|成功|飛び出し|別" : "【対象エリア】で【守備選手】のマークをかわした【攻撃選手】が前線のスペースへロングパスを通す！",
	"ロングパス|成功|ポストプレー|別" : "【対象エリア】、ルックアップした【攻撃選手】がロングボールを送る。これに【守備選手】が反応するがボールは取れない！",
	"ドリブル突破|成功|ショートパス|同" : "【攻撃選手】がドリブルで【守備選手】を抜き去り【対象エリア】を突破！",
	"ドリブル突破|成功|ロングパス|同" : "【攻撃選手】がドリブルで【守備選手】を抜き去り【対象エリア】を突破！",
	"ドリブル突破|成功|ドリブル突破|同" : "【攻撃選手】がドリブルで【守備選手】を抜き去り【対象エリア】を突破！",
	"ドリブル突破|成功|飛び出し|同" : "【攻撃選手】がドリブルで【守備選手】を抜き去り【対象エリア】を突破！　味方へボールを預けそのままDFのウラへ走りこむ！",
	"ドリブル突破|成功|ポストプレー|同" : "【攻撃選手】がドリブルで【守備選手】を抜き去り【対象エリア】を突破！　そのままボールをキープしタメを作る。",
	"ドリブル突破|成功|ショートパス|別" : "【対象エリア】、【攻撃選手】がドリブルで【守備選手】をかわし、【次の攻撃選手】へボールをつなぐ。",
	"ドリブル突破|成功|ロングパス|別" : "【対象エリア】、【攻撃選手】がドリブルで【守備選手】をかわし、【次の攻撃選手】へボールをつなぐ。",
	"ドリブル突破|成功|ドリブル突破|別" : "【対象エリア】、【攻撃選手】がドリブルで【守備選手】をかわし、【次の攻撃選手】へボールをつなぐ。",
	"ドリブル突破|成功|飛び出し|別" : "【対象エリア】、【攻撃選手】がドリブルで【守備選手】をかわし、【次の攻撃選手】へパスを通す！",
	"ドリブル突破|成功|ポストプレー|別" : "【対象エリア】、【攻撃選手】がドリブルで【守備選手】をかわし、タテにボールを入れる。",
	"ドリブル突破|成功|クロス" : "【対象エリア】、【攻撃選手】がドリブルで【守備選手】を抜き去った！！",
	"ドリブル突破|成功|シュート" : "【対象エリア】、【攻撃選手】がドリブルで【守備選手】を抜き去った！！",
	"飛び出し|成功|クロス" : "【対象エリア】、パスに反応した【攻撃選手】は、絶妙な飛び出しで【守備選手】を振り切る！",
	"飛び出し|成功|シュート" : "【対象エリア】、パスに反応した【攻撃選手】は、絶妙な飛び出しで【守備選手】を振り切る！",
	"ポストプレー|成功|ショートパス|同" : "【攻撃選手】が巧みなポストプレーから味方とワンツーで【対象エリア】を突破！　【守備選手】はボールを奪えない！",
	"ポストプレー|成功|ロングパス|同" : "【攻撃選手】が巧みなポストプレーから味方とワンツーで【対象エリア】を突破！　【守備選手】はボールを奪えない！",
	"ポストプレー|成功|ドリブル突破|同" : "【攻撃選手】が巧みなポストプレーから味方とワンツーで【対象エリア】を突破！　【守備選手】はボールを奪えない！",
	"ポストプレー|成功|飛び出し|同" : "【対象エリア】、【攻撃選手】が巧みなポストプレーから味方とワンツー！　【守備選手】をかわしてそのままウラへと走りこむ！",
	"ポストプレー|成功|ポストプレー|同" : "【攻撃選手】が【守備選手】のマークを受けながらボールをキープ。味方とのショートパスで【対象エリア】を突破！",
	"ポストプレー|成功|ショートパス|別" : "【対象エリア】、【攻撃選手】が【守備選手】のマークを受けながらボールをキープ。【次の攻撃選手】へボールをつなぐ。",
	"ポストプレー|成功|ロングパス|別" : "【対象エリア】、【攻撃選手】が【守備選手】のマークを受けながらボールをキープ。【次の攻撃選手】へボールをつなぐ。",
	"ポストプレー|成功|ドリブル突破|別" : "【対象エリア】、【攻撃選手】が【守備選手】のマークを受けながらボールをキープ。【次の攻撃選手】へボールをつなぐ。",
	"ポストプレー|成功|飛び出し|別" : "【対象エリア】、【攻撃選手】が【守備選手】のマークを受けながらボールをキープ。【守備選手】をかわして前線へパス！",
	"ポストプレー|成功|ポストプレー|別" : "【対象エリア】、【攻撃選手】が【守備選手】のマークを受けながらボールをキープ。【次の攻撃選手】へボールをつなぐ。",
	"ポストプレー|成功|クロス" : "【対象エリア】、【攻撃選手】が巧みなポストプレーでマークした【守備選手】を反転しかわす！",
	"ポストプレー|成功|シュート" : "【対象エリア】、【攻撃選手】が巧みなポストプレーでマークした【守備選手】を反転しかわす！",
	"ショートパス|失敗" : "【対象エリア】の【攻撃選手】がショートパス。しかし【守備選手】がみごとにこれをカット！",
	"ロングパス|失敗" : "【対象エリア】の【攻撃選手】がロングパスを狙うが、【守備選手】がみごとにこれをカット！",
	"ドリブル突破|失敗" : "【対象エリア】、【攻撃選手】がドリブル突破を試みるが、【守備選手】は的確な守備でこれを止める！",
	"飛び出し|失敗" : "【対象エリア】、【攻撃選手】がウラへ飛び出すが、【守備選手】が素早く反応しこのボールをクリア！",
	"ポストプレー|失敗" : "【対象エリア】、ボールをキープする【攻撃選手】に対して【守備選手】の積極的な守備！　ボールをみごとに奪取した！",
	"ショートパス|ファール" : "【対象エリア】、【攻撃選手】のパスに【守備選手】が反応して止める！　しかしこれはファール！",
	"ロングパス|ファール" : "【対象エリア】、ロングパスを狙う【攻撃選手】に対して、【守備選手】が積極的な守備。しかしこれはファールの判定。",
	"ドリブル突破|ファール" : "【対象エリア】、【攻撃選手】が鮮やかなドリブル！　かわされた【守備選手】がたまらずファールで止めた！",
	"飛び出し|ファール" : "【対象エリア】、ウラへ飛び出した【攻撃選手】に対して【守備選手】が体で止めるが、これはファールの判定！",
	"ポストプレー|ファール" : "【対象エリア】、ボールをキープする【攻撃選手】に対して【守備選手】が後ろからチャージ、これはファールだ！",
	"ショートパス|カウンター" : "【対象エリア】の【攻撃選手】がショートパス。しかし【守備選手】がみごとにこれをカット！　ここでカウンター！",
	"ロングパス|カウンター" : "【対象エリア】の【攻撃選手】がロングパスを狙うが、【守備選手】がみごとにこれをカット！　そして素早くカウンター！",
	"ドリブル突破|カウンター" : "【対象エリア】、【攻撃選手】がドリブル突破を試みるが、【守備選手】は的確な守備でこれを止める！　そのままカウンターをしかける！",
	"飛び出し|カウンター" : "【対象エリア】、【攻撃選手】がウラへ飛び出すが、【守備選手】が素早く反応しこのボールをクリア！　これがそのままカウンターになった！",
	"ポストプレー|カウンター" : "【対象エリア】、ボールをキープする【攻撃選手】に対して【守備選手】の積極的な守備！　ボールをみごとに奪取し、そのままカウンター！",
	"クロス|成功|ボレーシュート" : "【クロス選手】から中央へクロス！　このボールに反応した【シュート選手】は【守備選手】のマークをかわしてボレーシュート！",
	"クロス|成功|ヘディングシュート" : "【クロス選手】からのクロスに【シュート選手】が反応！　【守備選手】との空中戦を制してヘディングシュートを放つ！",
	"クロス|失敗|ボレーシュート" : "【クロス選手】から中央へクロス！　【シュート選手】がシュートを狙うが素早く反応した【守備選手】がこのボールをクリア！",
	"クロス|失敗|ヘディングシュート" : "【クロス選手】からのクロスに【シュート選手】が反応！　しかし【守備選手】がヘディングで【シュート選手】に競い勝ちボールをクリア！",
	"シュート|ゴール！！|中央からシュート" : "中央を突破した【シュート選手】がそのままシュート！　【守備選手】はこのボールを取れない！　<span style=\"color: #F00;\"><b>ゴーーーーーーーーール！！</b></span>",
	"シュート|GK防いだ！|中央からシュート" : "中央を突破した【シュート選手】がそのままシュート！　しかし【守備選手】が素早い反応でセーブ！",
	"シュート|枠を外した！|中央からシュート" : "中央を突破した【シュート選手】がそのままシュート！　しかしシュートは枠を外れた！",
	"シュート|ゴール！！|サイドからシュート" : "【シュート選手】はサイドから中央へ切れ込みシュートを放つ！　【守備選手】はシュートを止められない！　<span style=\"color: #F00;\"><b>ゴーーーーーーーーール！！</b></span>",
	"シュート|GK防いだ！|サイドからシュート" : "【シュート選手】はサイドから中央へ切れ込みシュートを放つ！　しかし【守備選手】がシュートを止めゴールは割らせない！",
	"シュート|枠を外した！|サイドからシュート" : "【シュート選手】はサイドから中央へ切れ込みシュートを放つ！　しかしシュートは枠を外れゴールならず。",
	"シュート|ゴール！！|ボレーシュート" : "【守備選手】がボレーシュートに反応するが届かない！　<span style=\"color: #F00;\"><b>ゴーーーーーーーーール！！</b></span>",
	"シュート|GK防いだ！|ボレーシュート" : "【守備選手】がボレーシュートに反応！　鋭いセービングでゴールを守った！",
	"シュート|枠を外した！|ボレーシュート" : "しかしシュートは枠を外れゴールならず・・！",
	"シュート|ゴール！！|ヘディングシュート" : "【守備選手】がヘディングシュートに反応するが届かない！　<span style=\"color: #F00;\"><b>ゴーーーーーーーーール！！</b></span>",
	"シュート|GK防いだ！|ヘディングシュート" : "【守備選手】がヘディングシュートに反応！　鋭いセービングでゴールを守った！",
	"シュート|枠を外した！|ヘディングシュート" : "しかしシュートは枠を外れゴールならず・・！",
	"セットプレー|成功|ボレーシュート" : "セットプレーのチャンス、【クロス選手】が鋭いボールをゴールにあげる！　【シュート選手】が【守備選手】のマークをかわしてシュート！",
	"セットプレー|成功|ヘディングシュート" : "ボールを置いた【クロス選手】がゴール前にボールを送る！　【守備選手】に競い勝った【シュート選手】がヘディングシュート！",
	"セットプレー|失敗|ボレーシュート" : "セットプレーのチャンス、【クロス選手】が鋭いボールをゴールにあげる！　しかし【守備選手】が素早く反応しクリア！　【シュート選手】にシュートを打たせない。",
	"セットプレー|失敗|ヘディングシュート" : "ボールを置いた【クロス選手】がゴール前にボールを送る！　【守備選手】が【シュート選手】に競り勝ちヘディングでクリア！",
	"シュート|ゴール！！|フリーキック" : "絶好の位置でのフリーキック。ボールをセットした【シュート選手】が放ったシュートは弧を描きゴールへ！　【守備選手】手を伸ばすが取れない！　<span style=\"color: #F00;\"><b>ゴーーーーーーーーール！！</b></span>",
	"シュート|GK防いだ！|フリーキック" : "絶好の位置でのフリーキック。ボールをセットした【シュート選手】が放ったシュートは弧を描きゴールへ！　しかし【守備選手】がスーパーセーブでシュートを止めた！",
	"シュート|枠を外した！|フリーキック" : "絶好の位置でのフリーキック。ボールをセットした【シュート選手】が放ったシュートは弧を描きゴールへ！　しかしシュートは惜しくも枠を外れゴールならず。"
};
